app/controllers/devices_controller.rb

SELECT "devices".* FROM "devices"
---
  def index
    @devices = Device.all

SELECT  "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @device = Device.find(params[:id])

INSERT INTO "devices" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Test Device"], ["created_at", "2020-07-13 13:37:36.679670"], ["updated_at", "2020-07-13 13:37:36.679670"]]
---
  def create
    @device = Device.new(device_params)

    respond_to do |format|
      if @device.save

UPDATE "devices" SET "name" = $1, "updated_at" = $2 WHERE "devices"."id" = $3  [["name", "Test Devicesdd"], ["updated_at", "2020-07-13 14:14:39.424180"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @device.update(device_params)

SELECT  "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_device
    @device = Device.find(params[:id])